app/controllers/colors_controller.rb

SELECT "colors".* FROM "colors"
---
  def index
    @colors = Color.all

INSERT INTO "colors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ujiji"], ["created_at", "2019-06-18 20:10:58.427827"], ["updated_at", "2019-06-18 20:10:58.427827"]]
---
  def create
    @color = Color.new(color_params)

    if @color.save

DELETE FROM "colors" WHERE "colors"."id" = $1  [["id", 1]]
---
  def destroy
    @color.destroy

SELECT  "colors".* FROM "colors" WHERE "colors"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_color
      @color = Color.find(params[:id])