app/controllers/logos_controller.rb

SELECT "logos".* FROM "logos"
---
    def index
      @logos = Logo.all

INSERT INTO "logos" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ll"], ["created_at", "2019-06-19 03:15:40.240887"], ["updated_at", "2019-06-19 03:15:40.240887"], ["user_id", 3]]
---
    def create
      @logo = Logo.new(logo_params)

      if @logo.save

DELETE FROM "logos" WHERE "logos"."id" = $1  [["id", 3]]
---
    def destroy
      @logo.destroy

SELECT  "logos".* FROM "logos" WHERE "logos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
      def set_logo
        @logo = Logo.find(params[:id])