app/controllers/users_controller.rb

INSERT INTO "users" ("name", "age", "size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "fjf"], ["age", 0], ["size", "fjf"], ["created_at", "2019-06-17 04:50:49.705364"], ["updated_at", "2019-06-17 04:50:49.705364"]]
---
  def create
    @user = User.new(user_params)

    if @user.save